Revit 2024 API
StructuralSectionConcreteT.CantileverLength Property
 Flange cantilever length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double CantileverLength { get; set; }
Visual Basic
Public Property CantileverLength As Double
	Get
	Set
Visual C++
public:
property double CantileverLength {
	double get ();
	void set (double value);
}
See Also
StructuralSectionConcreteT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace